createSurfaceFromCurvesWithSameParams(GCurve!System.Runtime.CompilerServices.IsConst*,GCurve!System.Runtime.CompilerServices.IsConst*)
creates a surface where the u parameter corresponds to the raw parameter on pCrv1,
and the v corresponds to the raw parameter on pCrv2